dist/guia-linux/linux-gestores-de-paquetes.html
<!--?xml version="1.0" encoding="utf-8"?--><!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head>
<!-- 2021-10-19 mar 02:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Guia Linux - Gestores de Paquetes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jelou">
<link rel="stylesheet" type="text/css" href="/assets/css/style.css">
<link rel="stylesheet" type="text/css" href="/assets/css/sass-style.css">
</head>
<body>
<div id="content">
<h1 class="title">Guia Linux - Gestores de Paquetes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f4eb9f">1. Pacman</a>
<ul>
<li><a href="#org3a4f909">1.1. Comandos Basicos</a></li>
<li><a href="#org9545950">1.2. Instalar paquetes y evitar confirmar la instalación</a></li>
<li><a href="#org99e3468">1.3. AUR Helpers</a>
<ul>
<li><a href="#orgb1071d9">1.3.1. AURMAN</a></li>
</ul>
</li>
<li><a href="#org587e9bc">1.4. Posibles errores</a>
<ul>
<li><a href="#org2692dd3">1.4.1. Permisos para instalar paquetes</a></li>
<li><a href="#org3771396">1.4.2. No funciona Pacstrap</a></li>
<li><a href="#orgabfd94b">1.4.3. Referencias</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org56a8971">2. Referencias</a>
<ul>
<li><a href="#org9b5e0f6">2.1. Referencias Web Oficiales</a></li>
<li><a href="#orgd49b7e1">2.2. Referencias Web Extraoficiales</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2f4eb9f" class="outline-2">
<h2 id="org2f4eb9f"><span class="section-number-2">1.</span> Pacman</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3a4f909" class="outline-3">
<h3 id="org3a4f909"><span class="section-number-3">1.1.</span> Comandos Basicos</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell" id="orgbab351e"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Install a package(s)</span>
pacman -S

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Remove a package(s)</span>
pacman -Rs

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Search for package(s</span>
pacman -Ss

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Upgrade Packages</span>
pacman -Syu
</pre>
</div>
</div>
</div>
<div id="outline-container-org9545950" class="outline-3">
<h3 id="org9545950"><span class="section-number-3">1.2.</span> Instalar paquetes y evitar confirmar la instalación</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-shell" id="orgc7cb3ab">pacman -S --noconfirm apache

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">otra alternativa seria la siguiente</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">yes | pacman -S apache</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org99e3468" class="outline-3">
<h3 id="org99e3468"><span class="section-number-3">1.3.</span> AUR Helpers</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgb1071d9" class="outline-4">
<h4 id="orgb1071d9"><span class="section-number-4">1.3.1.</span> AURMAN</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="org30c740f"></a>Instalación<br>
<div class="outline-text-5" id="text-1-3-1-1">
<p>
Para instalar ingresar lo siguiente en la terminal
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org72277c2">git clone https://aur.archlinux.org/aurman.git
<span style="color: #4f97d7;">cd</span> aurman &amp;&amp; makepkg -si
</pre>
</div>
</div>
</li>
<li><a id="org11f5154"></a>Buscar Paquetes<br>
<div class="outline-text-5" id="text-1-3-1-2">
<div class="org-src-container">
<pre class="src src-shell" id="org81892ea">aurman -Ss nombre_paquete
</pre>
</div>
</div>
</li>
<li><a id="orgd246c43"></a>Instalar Paquetes<br>
<div class="outline-text-5" id="text-1-3-1-3">
<div class="org-src-container">
<pre class="src src-shell" id="orgc64287e">aurman -S nombre_paquete
</pre>
</div>
</div>
</li>
<li><a id="orgce28413"></a>Problemas frecuentes<br>
<div class="outline-text-5" id="text-1-3-1-4">
<p>
Si al intentar compilar con <code>makepkg -si</code> y nos lanza el siguiente error,
debemos copiar la <b>clave pública desconocida</b> que nos aparece.
Luego la importarmos con <code>gpg --recv-key</code> (que la descagará del servidor que tengamos
por defecto), si queremos especificar de que servidor agregamos el parámetro <b>-keyserver</b>
seguido de la ruta del servidor
</p>

<p>
<b>Posible Problema:</b>
</p>
<pre class="example" id="orga04e7d0">==&gt; Validando los archivos source con md5sums...
aurman_sources ... Omitido
==&gt; Verificando las firmas de las fuentes con gpg...
aurman_sources git repo ... HA FALLADO (clave pública desconocida 465022E743D71E39)
==&gt; ERROR: ¡No se ha podido verificar alguna de las firmas PGP!
</pre>

<p>
<b>Posible Solucion:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org6c8e6a9"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">importamos la clave</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Observación:</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Si se omite el parámetro -keyserver, usará el servidor que tengamos por defecto</span>
gpg --recv-key CLAVE_PUBLICA_ERROR

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Intentamos compilar nuevamente</span>
makepkg -si
</pre>
</div>
</div>
</li>
<li><a id="orge309007"></a>Referencias Web Oficiales<br>
<div class="outline-text-5" id="text-1-3-1-5">
<ol class="org-ol">
<li><a href="https://wiki.archlinux.org/index.php/GnuPG_(Espa%C3%B1ol)">GnuPG - Wiki, ArchLinux.org</a></li>
<li><a href="https://wiki.archlinux.org/index.php/AUR_helpers_(Espa%C3%B1ol)">AUR Helpers - Wiki, ArchLinux.org</a></li>
</ol>
</div>
</li>
<li><a id="orgbf7e6b4"></a>Referencias Web Extraoficiales<br>
<div class="outline-text-5" id="text-1-3-1-6">
<ol class="org-ol">
<li><a href="https://www.fossmint.com/best-aur-helpers-for-arch-linux/">Los mejores ayudantes(helpers) de AUR - Fossmint.com</a></li>
<li><a href="https://denovatoanovato.net/gestores-de-paquetes-aur-helpers-archlinux/">Gestores de Paquetes AUR - denovatoanovato.net</a></li>
<li><a href="https://blog.desdelinux.net/yay-una-excelente-ayudante-para-aur-y-una-alternativa-a-yaourt/">YAY para AUR - Blog, desdelinux.net</a></li>
<li><a href="https://www.evaristogz.com/crear-publicar-firmar-claves-gpg-pgp/">Crear/Publicar/Firmar claves GPG</a></li>
<li><a href="https://www.genbeta.com/desarrollo/manual-de-gpg-cifra-y-envia-datos-de-forma-segura">Manual de GPG cifrar/enviar datos de forma segura - Genbeta.com</a></li>
<li><a href="https://forum.manjaro.org/t/aur-package-fails-to-verify-pgp-gpg-key-unknown-public-key-one-or-more-pgp-signatures-could-not-be-verified/42687">Problemas al instalar Aurman - forum.manjaro.org</a></li>
<li><a href="https://www.linuxadictos.com/las-mejores-alternativas-para-reemplazar-yaourt-en-arch-linux.html">Alternativas para reemplazar yaourt - linuxadictos.com</a></li>
<li><a href="https://maslinux.es/yaourt-esta-muerto-utiliza-estas-alternativas-para-aur-en-arch-linux/">Yaourt esta deprecado en Arch Linux - maslinux.net</a></li>
</ol>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org587e9bc" class="outline-3">
<h3 id="org587e9bc"><span class="section-number-3">1.4.</span> Posibles errores</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org2692dd3" class="outline-4">
<h4 id="org2692dd3"><span class="section-number-4">1.4.1.</span> Permisos para instalar paquetes</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
<b>Problema:</b>
</p>
<pre class="example" id="orgf935875">fdisk: cannot open /dev/sda: Permission denied
</pre>

<p>
<b>Solución:</b>
Escribir en la terminal <b>su</b> presionar Enter, y escribir la password
</p>
</div>
</div>
<div id="outline-container-org3771396" class="outline-4">
<h4 id="org3771396"><span class="section-number-4">1.4.2.</span> No funciona Pacstrap</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Esto puede suceder en el proceso de instalación de <b>arch linux</b>
</p>

<p>
<b>Problema:</b>
</p>
<pre class="example" id="orgb952751">[root@archlinux vagrant]# pacstrap
bash: pacstrap: command not found
</pre>

<p>
<b><b>Solución:</b></b>
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org703af59"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">instalamos pkgfile</span>
yes | pacman -S pkgfile

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">lo actualizamos</span>
pkgfile --update

pkgfile pacstrap

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">instalamos los scripts faltantes</span>
yes | pacman -S extra/arch-install-scripts
</pre>
</div>
</div>
</div>
<div id="outline-container-orgabfd94b" class="outline-4">
<h4 id="orgabfd94b"><span class="section-number-4">1.4.3.</span> Referencias</h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<ol class="org-ol">
<li><a id="org535a986"></a>Referencias Web Oficiales<br>
<div class="outline-text-5" id="text-1-4-3-1">
<ol class="org-ol">
<li><a href="https://github.com/archlinux/arch-install-scripts/blob/master/pacstrap.in">Pacstrap, Arch Install Scripts - Github, ArchLinux</a></li>
<li><a href="https://wiki.archlinux.org/index.php/Pacman">Pacman - Wiki, ArchLinux.org</a></li>
<li><a href="https://archlinuxarm.org/forum/viewtopic.php?f=60&amp;t=8529">Referencia #1 - Arch Linux Arm</a></li>
</ol>
</div>
</li>
<li><a id="org228715c"></a>Referencias Web Extraoficiales<br>
<div class="outline-text-5" id="text-1-4-3-2">
<ol class="org-ol">
<li><a href="https://www.muylinux.com/2012/08/01/arch-linux-instalador/">Arch Linux sin instalador - Muylinux.com</a></li>
</ol>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org56a8971" class="outline-2">
<h2 id="org56a8971"><span class="section-number-2">2.</span> Referencias</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9b5e0f6" class="outline-3">
<h3 id="org9b5e0f6"><span class="section-number-3">2.1.</span> Referencias Web Oficiales</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li><a href="https://wiki.archlinux.org/index.php/Pacman">Pacman Comandos - Documentación Oficial</a></li>
<li><a href="https://wiki.archlinux.org/index.php/USB_flash_installation_medium_(Espa%C3%B1ol)">USB Flash Installation Media - Wiki, ArchLinux.org</a></li>
<li><a href="https://wiki.archlinux.org/index.php/Multiboot_USB_drive_(Espa%C3%B1ol)">Multiboot Usb Drive - Wiki, ArchLinux.org</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgd49b7e1" class="outline-3">
<h3 id="orgd49b7e1"><span class="section-number-3">2.2.</span> Referencias Web Extraoficiales</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/35343707/linux-apt-get-command-not-found-how-to-install-a-package-in-arch-linux">Referencia #1 - StackOverflow.com</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-10-19 mar 02:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>